## Predicting Loan Default

In [6]:
# import the necessary libraries
import numpy as np
import pandas as pd

# for visulas
import seaborn as sns
import matplotlib.pyplot as plt
plt.style.use('ggplot')

In [7]:
## import and  read file 
df = pd.read_excel("DATASET/Default_Fin.xlsx")
df.head()

   Index  Employed  Bank Balance  Annual Salary  Defaulted?
0      1         1       8754.36      532339.56           0
1      2         0       9806.16      145273.56           0
2      3         1      12882.60      381205.68           0
3      4         1       6351.00      428453.88           0
4      5         1       9427.92      461562.00           0

In [8]:
# drop the index column
df.drop(columns='Index', inplace=True)
df.head()

   Employed  Bank Balance  Annual Salary  Defaulted?
0         1       8754.36      532339.56           0
1         0       9806.16      145273.56           0
2         1      12882.60      381205.68           0
3         1       6351.00      428453.88           0
4         1       9427.92      461562.00           0

In [9]:
# Rename Defaulted? as Defaulted
df.rename(columns={'Defaulted?': 'Defaulted'}, inplace=True)
df.head()

   Employed  Bank Balance  Annual Salary  Defaulted
0         1       8754.36      532339.56          0
1         0       9806.16      145273.56          0
2         1      12882.60      381205.68          0
3         1       6351.00      428453.88          0
4         1       9427.92      461562.00          0

In [10]:
# Check Unique Values
df['Employed'].value_counts()

1    7056
0    2944
Name: Employed, dtype: int64

In [11]:
# write a code for the Employed to have 0 = unemployed, 1 = employed
def employ_status(x):
    if x == 1:
        return 'Employed'
    else:
        return 'Unemployed'
df['Employed'] = df['Employed'].apply(employ_status)
df.head()

     Employed  Bank Balance  Annual Salary  Defaulted
0    Employed       8754.36      532339.56          0
1  Unemployed       9806.16      145273.56          0
2    Employed      12882.60      381205.68          0
3    Employed       6351.00      428453.88          0
4    Employed       9427.92      461562.00          0

In [12]:
# Summary statistics of the data
df.describe().astype('int')

       Bank Balance  Annual Salary  Defaulted
count         10000          10000      10000
mean          10024         402203          0
std            5804         160039          0
min               0           9263          0
25%            5780         256085          0
50%            9883         414631          0
75%           13995         525692          0
max           31851         882650          1

In [13]:
# Check for negative value
df[df[['Bank Balance', 'Annual Salary']]< 0 ].sum()

Employed           0
Bank Balance     0.0
Annual Salary    0.0
Defaulted        0.0
dtype: object